

var event1 = {
    "name":"Повреждение кабельной линии РП №2 - ТП-34",
    "messages" : [
        {
            "id" : 1,
            "from" : {
            	"id" : 1,
            	"name" : "ДЭМ ОВБ-4"
            },
            "to" : {
            	"id" : 2,
            	"name" : "САЦ"
            },
            "message" : "По пути следования к ТП-34, рядом с автодорогой, обнаружен оползень в месте прохождения трассы КЛ 10 кВ РП №2-ТП-34. Виден поврежденный кабель, предположительно идущий к ТП-34",
            "start_time" : "2014-11-20 10:14:00",
            "type_message":"ОЖУР",
        },
        {
            "id" : 2,
            "from" : {
            	"id" : 1,
            	"name" : "ДЭМ ОВБ-4"
            },
            "to" : {
            	"id" : 2,
            	"name" : "САЦ"
            },
            "message" : "ДЭМ ОВБ-4 прибыл на ТП-34. Осмотрены ячейки №9 и №8. ВЭ-10 ТП-34 отключен действием З.З. и АВР успешно. Погашенных потребителей нет. Замечаний по оборудованию ячеек №№9, 8 нет.",
            "start_time" : "2014-11-20 10:20:00"
        },
        {
            "id" : 3,
            "from" : {
            	"id" : 3,
            	"name" : "Гл. инженер Сочинского ПМЭС"
            },
            "to" : {
            	"id" : 4,
            	"name" : "САЦ"
            },
            "message" : "Обнаружено место повреждения КЛ 10кВ РП-2-ТП-34 в результате оползня. Начальнику службы ЛЭП приступить к немедленной организации ремонтно-восстановительных работ",
            "start_time" : "2014-11-20 10:17:00"
        },
        {
            "id" : 4,
            "from" : {
            	"id" : 2,
            	"name" : "ДД Краснополянского ЦУГП"
            },
            "to" : {
            	"id" : 5,
            	"name" : "САЦ"
            },
            "message" : "ДЭМ ОВБ-3 Выдвинуться на РП №2 10 кВ для осмотра ячейки №21",
            "start_time" : "2014-11-20 10:02:00"
        },
        {
            "id" : 5,
            "from" : {
            	"id" : 2,
            	"name" : "ДД Краснополянского ЦУГП"
            },
            "to" : {
            	"id" : 5,
            	"name" : "САЦ"
            },
            "message" : "Подготовить бланк переключений на вывод в ремонт КЛ 10 кВ РП-2 - ТП-34",
            "start_time" : "2014-11-20 10:19:00"
        },
        {
            "id" : 6,
            "from" : {
            	"id" : 2,
            	"name" : "ДД Краснополянского ЦУГП"
            },
            "to" : {
            	"id" : 1,
            	"name" : "САЦ"
            },
            "message" : "ДЭМ ОВБ-4 Выдвинутся на ТП-34 для осмотра ячеек 1С 10кВ, 2С 10кВ",
            "start_time" : "2014-11-20 10:03:00"
        },
        {
            "id" : 7,
            "from" : {
            	"id" : 2,
            	"name" : "ДД Краснополянского ЦУГП"
            },
            "to" : {
            	"id" : 1,
            	"name" : "САЦ"
            },
            "message" : "Подготовить бланк переключений на вывод в ремонт КЛ 10 кВ РП-2 - ТП-34",
            "start_time" : "2014-11-20 10:21:00"
        },
        {
            "id" : 8,
            "from" : {
            	"id" : 2,
            	"name" : "ДД Краснополянского ЦУГП"
            },
            "to" : {
            	"id" : 3,
            	"name" : "САЦ"
            },
            "message" : "Отключилась КЛ 10 кВ РП-2-ТП-34. ОВБ-3 и ОВБ-4 выдвигаются на РП-2 и ТП-34 для осмотра оборудования",
            "start_time" : "2014-11-20 10:04:00"
        },
        {
            "id" : 9,
            "from" : {
            	"id" : 2,
            	"name" : "ДД Краснополянского ЦУГП"
            },
            "to" : {
            	"id" : 3,
            	"name" : "САЦ"
            },
            "message" : "Отключилась КЛ 10кВ РП-2-ТП-34. ДЭМ ОВБ-4 по пути следования к ТП-34, рядом с автодорогой, обнаружил оползень в месте прохождения трассы КЛ 10 кВ РП №2-ТП-34. Виден поврежденный кабель, предположительно идущий к ТП-34",
            "start_time" : "2014-11-20 10:25:00"
        },
        {
            "id" : 10,
            "from" : {
            	"id" : 5,
            	"name" : "ДЭМ ОВБ-3"
            },
            "to" : {
            	"id" : 2,
            	"name" : "САЦ"
            },
            "message" : "ДЭМ ОВБ-3 прибыл на РП-2. Осмотрена ячейка №23. ВЭ 10 ТП-34 отключен действием З.З. и МТЗ. Замечаний по оборудованию ячейки №21 нет",
            "start_time" : "2014-11-20 10:17:00"
        }
    ]
};

var event2 = {
    "name":"АО15_Эпизод11_Ввод в работу КЛ 110 кВ Лаура-Псехако 1 окончание АВР",
    "messages" : [
        {
            "id" : 1,
            "from" : {
            	"id" : 1,
            	"name" : "ОЗЭ СВИ"
            },
            "to" : {
            	"id" : 2,
            	"name" : "САЦ"
            },
            "message" : "Работы на КЛ 110 кВ Лаура-Псехако-1 завершены, КЛ готова к вводу в работу",
            "start_time" : "2014-11-20 10:00:00"
        },
        {
            "id" : 2,
            "from" : {
            	"id" : 3,
            	"name" : "РукСмены ЦУЭ "
            },
            "to" : {
            	"id" : 2,
            	"name" : "САЦ"
            },
            "message" : "Уведомление СИ-23",
            "start_time" : "2014-11-20 10:25:00"
        },
        {
            "id" : 3,
            "from" : {
            	"id" : 3,
            	"name" : "РукСмены ЦУЭ"
            },
            "to" : {
            	"id" : 2,
            	"name" : "САЦ"
            },
            "message" : "Доклад СИ-23",
            "start_time" : "2014-11-20 10:32:00"
        },
     /*   {
            "id" : 4,
            "from" : {
            	"id" : 3,
            	"name" : "РукСмены ЦУЭ"
            },
            "to" : {
            	"id" : 2,
            	"name" : "САЦ"
            },
            "message" : "Передача СИ-24",
            "start_time" : "2014-11-20 10:51:00"
        },*/
        {
            "id" : 5,
            "from" : {
            	"id" : 6,
            	"name" : "ОД СО ЦУЭ"
            },
            "to" : {
            	"id" : 2,
            	"name" : "САЦ"
            },
            "message" : "СИ-23",
            "start_time" : "2014-11-20 10:20:00"
        },
        {
            "id" : 6,
            "from" : {
            	"id" : 9,
            	"name" : "ДД Кб РДУ"
            },
            "to" : {
            	"id" : 2,
            	"name" : "САЦ"
            },
            "message" : "Ввести в работу КЛ 110 кВ Лаура - Псехако - 1",
            "start_time" : "2014-11-20 10:10:00"
        },
        {
            "id" : 7,
            "from" : {
            	"id" : 67,
            	"name" : "ДД Кб РДУ"
            },
            "to" : {
            	"id" : 2,
            	"name" : "САЦ"
            },
            "message" : "СИ -23",
            "start_time" : "2014-11-20 10:15:00"
        },
        {
            "id" : 8,
            "from" : {
            	"id" : 67,
            	"name" : "ДД Кб РДУ"
            },
            "to" : {
            	"id" : 2,
            	"name" : "САЦ"
            },
            "message" : "Ввести в работу КЛ 110 кВ Лаура - Псехако - 1",
            "start_time" : "2014-11-20 10:05:00"
        },
      /*  {
            "id" : 9,
            "from" : {
            	"id" : 5,
            	"name" : " ГЭО"
            },
            "to" : {
            	"id" : 2,
            	"name" : "САЦ"
            },
            "message" : "Принял решение СИ-24",
            "start_time" : "2014-11-20 10:50:00"
        }*/
    ]
};

var event3 = {
    "name":"Повреждение ВЛ-220 Б10-Погорелово",
    "messages" : [
        {
            "id" : 1,
            "from" : {
                "id" : 1,
                "name" : "ДД Краснолобов С.А."
            },
            "to" : {
                "id" : 4,
                "name" : "САЦ"
            },
            "message" : "16-21 АО с неуспешным АПВ ВЛ-220 Б10-Погорелово.Б10: ДФЗ. Погорелово: ДФЗ, 1ст.ТЗНП.",
            "start_time" : "2014-03-13 16:30:05"
        },
        {
            "id" : 2,
            "from" : {
                "id" : 1,
                "name" : "ДД Краснолобов С.А."
            },
            "to" : {
                "id" : 4,
                "name" : "САЦ"
            },
            "message" : "17-08 РПВ ВЛ-220 Б10-Погорелово успешно. ВЛ в работе.",
            "start_time" : "2014-03-13 17:15:26"
        },
        {
            "id" : 3,
            "from" : {
                "id" : 1,
                "name" : "ДД Краснолобов С.А."
            },
            "to" : {
                "id" : 4,
                "name" : "САЦ"
            },
            "message" : "16-56 13.03.14 Начат ПА осмотр ВЛ-220 Б-10 - Погорелово, пр. оп. 178-209 (53-61 км от ПС Б-10).",
            "start_time" : "2014-03-13 17:08:40"
        },
        {
            "id" : 4,
            "from" : {
                "id" : 2,
                "name" : "ДД Демченко"
            },
            "to" : {
                "id" : 4,
                "name" : "САЦ"
            },
            "message" : "Закончен ПА осмотр ВЛ-220 Б10-Погорелово, пр.оп.178-190(53-55,9 км от ПС Б10). Повреждений не обнаружено. 14.03.14 осмотр будет продолжен.",
            "start_time" : "2014-03-13 19:14:44"
        },
        {
            "id" : 5,
            "from" : {
                "id" : 3,
                "name" : "ДД Люфт"
            },
            "to" : {
                "id" : 5,
                "name" : "САЦ"
            },
            "message" : "08-04 14.03.14 Продолжен ПА осмотр ВЛ-220 Б10-Погорелово пр. оп. 190-209(55,9км от ПС Погорелово - до ПС Погорелово).",
            "start_time" : "2014-03-14 08:13:44"
        },
        {
            "id" : 6,
            "from" : {
                "id" : 3,
                "name" : "ДД Люфт"
            },
            "to" : {
                "id" : 5,
                "name" : "САЦ"
            },
            "message" : "11-16 14.03.14 Закончен осмотр ВЛ-220 Б10-Погорелово. Обнаружено: под ф.В сгоревшие покрышки и остатки медного кабеля. На проводе ф.В видны следы перекрытия.",
            "start_time" : "2014-03-14 11:24:04"
        }
    ]
};

var event4 = {
    "name":"Повреждение ВЛ-220 Б10-Погорелово",
    "messages" : [
        {
            "id" : 1,
            "from" : {
                "id" : 1,
                "name" : "Регистрация ситуации (РС)"
            },
            "to" : {
                "id" : 4,
                "name" : "Вербицкий А.Н."
            },
            "message" : "16-21 АО с неуспешным АПВ ВЛ-220 Б10-Погорелово.",
            "start_time" : "2014-03-13 16:30:05"
        },
        {
            "id" : 2,
            "from" : {
                "id" : 2,
                "name" : "Оценка ситуации (ОС)"
            },
            "to" : {
                "id" : 4,
                "name" : "Вербицкий А.Н."
            },
            "message" : "Б10: ДФЗ.",
            "start_time" : "2014-03-13 16:30:05"
        },
        {
            "id" : 3,
            "from" : {
                "id" : 2,
                "name" : "Оценка ситуации (ОС)"
            },
            "to" : {
                "id" : 4,
                "name" : "Вербицкий А.Н."
            },
            "message" : "Погорелово: ДФЗ, 1ст.ТЗНП.",
            "start_time" : "2014-03-13 16:30:05"
        },
        {
            "id" : 4,
            "from" : {
                "id" : 2,
                "name" : "Оценка ситуации (ОС)"
            },
            "to" : {
                "id" : 4,
                "name" : "Вербицкий А.Н."
            },
            "message" : "17-08 РПВ ВЛ-220 Б10-Погорелово успешно.",
            "start_time" : "2014-03-13 17:15:26"
        },
        {
            "id" : 5,
            "from" : {
                "id" : 2,
                "name" : "Оценка ситуации (ОС)"
            },
            "to" : {
                "id" : 4,
                "name" : "Вербицкий А.Н."
            },
            "message" : "ВЛ в работе.",
            "start_time" : "2014-03-13 17:15:26"
        },
        {
            "id" : 6,
            "from" : {
                "id" : 4,
                "name" : "Исполнительские действия (ИД)"
            },
            "to" : {
                "id" : 4,
                "name" : "Вербицкий А.Н."
            },
            "message" : "16-56 13.03.14 Начат ПА осмотр ВЛ-220 Б-10 - Погорелово, пр. оп. 178-209 (53-61 км от ПС Б-10).",
            "start_time" : "2014-03-13 17:08:40"
        },
        {
            "id" : 7,
            "from" : {
                "id" : 4,
                "name" : "Исполнительские действия (ИД)"
            },
            "to" : {
                "id" : 4,
                "name" : "Вербицкий А.Н."
            },
            "message" : "Закончен ПА осмотр ВЛ-220 Б10-Погорелово, пр.оп.178-190(53-55,9 км от ПС Б10).",
            "start_time" : "2014-03-13 19:14:44"
        },
        {
            "id" : 8,
            "from" : {
                "id" : 2,
                "name" : "Оценка ситуации (ОС)"
            },
            "to" : {
                "id" : 4,
                "name" : "Вербицкий А.Н."
            },
            "message" : "Повреждений не обнаружено.",
            "start_time" : "2014-03-13 19:15:44"
        },
        {
            "id" : 9,
            "from" : {
                "id" : 3,
                "name" : "Принятие решений (ПР)"
            },
            "to" : {
                "id" : 4,
                "name" : "Вербицкий А.Н."
            },
            "message" : "14.03.14 осмотр будет продолжен.",
            "start_time" : "2014-03-13 19:18:44"
        },
        {
            "id" : 10,
            "from" : {
                "id" : 4,
                "name" : "Исполнительские действия (ИД)"
            },
            "to" : {
                "id" : 5,
                "name" : "Кравченков С.Г."
            },
            "message" : "08-04 14.03.14 Продолжен ПА осмотр ВЛ-220 Б10-Погорелово пр. оп. 190-209(55,9км от ПС Погорелово - до ПС Погорелово).",
            "start_time" : "2014-03-14 08:13:44"
        },
        {
            "id" : 11,
            "from" : {
                "id" : 5,
                "name" : "Завершение ситуации (ЗС)"
            },
            "to" : {
                "id" : 5,
                "name" : "Кравченков С.Г."
            },
            "message" : "",
            "start_time" : "2014-03-14 08:13:44"
        }
    ]
};

var event_data =[event1,event2,event3,event4];
