var radec1 = {
    "id" : 1,
    "name" : "Повреждение ВЛ-220 Б10-Погорелово",
    "code" : "",
    "registration" : [
        {
            "id" : "11",
            "registration" : "16-21 АО с неуспешным АПВ ВЛ-220 Б10-Погорелово.",
            "date_time" : "2014-03-13 16:30:05",
            "subject" : "Вербицкий А.Н."
        }
    ],
    "analize" : [
        {
            "id" : "21",
            "analize" : "Б10: ДФЗ.",
            "date_time" : "2014-03-13 16:30:05",
            "subject" : "Вербицкий А.Н."
        },
        {
            "id" : "22",
            "analize" : "Погорелово: ДФЗ, 1ст.ТЗНП.",
            "date_time" : "2014-03-13 16:35:05",
            "subject" : "Вербицкий А.Н."
        },
        {
            "id" : "23",
            "analize" : "17-08 РПВ ВЛ-220 Б10-Погорелово успешно.",
            "date_time" : "2014-03-13 17:15:26",
            "subject" : "Вербицкий А.Н."
        },
        {
            "id" : "24",
            "analize" : "ВЛ в работе.",
            "date_time" : "2014-03-13 17:20:26",
            "subject" : "Вербицкий А.Н."
        },
        {
            "id" : "25",
            "analize" : "Повреждений не обнаружено.",
            "date_time" : "2014-03-13 19:15:44",
            "subject" : "Вербицкий А.Н."
        }
    ],
    "decision" : [
        {
            "id" : "31",
            "decision" : "14.03.14 осмотр будет продолжен.",
            "date_time" : "2014-03-13 19:18:44",
            "subject" : "Вербицкий А.Н."
        }
    ],
    "execution" : [
        {
            "id" : "41",
            "execution" : "16-56 13.03.14 Начат ПА осмотр ВЛ-220 Б-10 - Погорелово, пр. оп. 178-209 (53-61 км от ПС Б-10).",
            "date_time" : "2014-03-13 17:08:40",
            "subject" : "Вербицкий А.Н."
        },
        {
            "id" : "42",
            "execution" : "Закончен ПА осмотр ВЛ-220 Б10-Погорелово, пр.оп.178-190(53-55,9 км от ПС Б10).",
            "date_time" : "2014-03-13 19:14:44",
            "subject" : "Вербицкий А.Н."
        },
        {
            "id" : "43",
            "execution" : "08-04 14.03.14 Продолжен ПА осмотр ВЛ-220 Б10-Погорелово пр. оп. 190-209(55,9км от ПС Погорелово - до ПС Погорелово).",
            "date_time" : "2014-03-14 08:13:44",
            "subject" : "Кравченков С.Г."
        }
    ],
    "conclusion" : [
        {
            "id" : "51",
            "conclusion" : "Осмотр окончен. Повреждений не обнаружено.",
            "date_time" : "2014-03-14 09:00:00",
            "subject" : "Вербицкий А.Н."
        }
    ]
};

var radec_data =[radec1];