var situation1 = {
    "name":"Повреждение ВЛ-220 Б10-Погорелово",
    "messages" : [
        {
            "id" : 1,
            "subject":"ДЭВ 7",
            "message" : "M01: 16-21 АО с неуспешным АПВ ВЛ-220. Б10-Погорелово.Б10: ДФЗ. Погорелово: ДФЗ, 1ст.ТЗНП.",
            "start_time" : "2013-03-13 16:15:05",
            "end_time" : "2013-03-13 16:30:05",
            "events" : [
                {
                    "id" : 11,
                    "marker":"АПВ",
                    "content" : "E1: АПВ неуспешно",
                    "start_time" : "2013-03-13 16:21:05"
                },
                {
                    "id" : 121,
                    "marker":"ТЗНП",
                    "content" : "E2: ДФЗ, 1ст.ТЗНП",
                    "start_time" : "2013-03-13 16:23:25"
                },
                {
                    "id" : 13,
                    "marker":"РПВ",
                    "content" : "E3: РПВ успешно",
                    "start_time" : "2013-03-13 16:27:20"
                }
            ]
        },
        {
            "id" : 2,
            "subject":"ДЭВ 4",
            "message" : "M03: 16-35 АО с неуспешным АПВ ВЛ-220. Б10-Погорелово.Б10: ДФЗ. Погорелово: ДФЗ, 1ст.ТЗНП.",
            "start_time" : "2013-03-13 16:35:05",
            "end_time" : "2013-03-13 16:35:05",
            "events" : [
                {
                    "id" : 112,
                    "marker":"АПВ",
                    "content" : "E1: АПВ неуспешно",
                    "start_time" : "2013-03-13 16:21:05"
                },
                {
                    "id" : 1212,
                    "marker":"ТЗНП",
                    "content" : "E2: ДФЗ, 1ст.ТЗНП",
                    "start_time" : "2013-03-13 16:23:25"
                },
                {
                    "id" : 133,
                    "marker":"РПВ",
                    "content" : "E3: РПВ успешно",
                    "start_time" : "2013-03-13 16:27:20"
                }
            ]
        },
         {
            "id" : 4,
            "subject":"ДЭВ 5",
            "message" : "M03: 16-35 АО с неуспешным АПВ ВЛ-220. Б10-Погорелово.Б10: ДФЗ. Погорелово: ДФЗ, 1ст.ТЗНП.",
            "start_time" : "2013-03-13 16:55:05",
            "end_time" : "2013-03-13 16:55:05",
            "events" : [
                {
                    "id" : 111,
                    "marker":"АПВ",
                    "content" : "E1: АПВ неуспешно",
                    "start_time" : "2013-03-13 16:21:05"
                },
                {
                    "id" : 126,
                    "marker":"ТЗНП",
                    "content" : "E2: ДФЗ, 1ст.ТЗНП",
                    "start_time" : "2013-03-13 16:23:25"
                },
                {
                    "id" : 131,
                    "marker":"РПВ",
                    "content" : "E3: РПВ успешно",
                    "start_time" : "2013-03-13 16:27:20"
                }
            ]
        },
        {
            "id" : 3,
             "subject":"ДЭВ 6",
            "message" : "M02: 17-08 РПВ ВЛ-220 Б10-Погорелово успешно. ВЛ в работе.",
            "start_time" : "2013-03-13 17:25:26",
            "end_time" : "2013-03-13 17:30:50",
            "events" : [
                {
                    "id" : 27,
                    "marker":"РПВ",
                    "content" : "E3: РПВ успешно",
                    "start_time" : "2013-03-13 17:08:26"
                },
                {
                    "id" : 288,
                    "marker":"ВЛ",
                    "content" : "E4: ВЛ в работе",
                    "start_time" : "2013-03-13 17:15:26"
                }
            ]
        }
    ]
};

var situation2 = {
    "name":"Повреждение ВЛ-220 Б10-Погорелово",
    "messages" : [
        {
            "id" : 1,
            "message" : "M01: 16-21 АО с неуспешным АПВ ВЛ-220. Б10-Погорелово. Б10: ДФЗ. Погорелово: ДФЗ, 1ст.ТЗНП.",
            "start_time" : "2013-03-13 16:15:05",
            "end_time" : "2013-03-13 16:25:05",
            "events" : [
                {
                    "id" : 11,
                    "marker":"АПВ",
                    "content" : "E1: АПВ неуспешно",
                    "start_time" : "2013-03-13 16:21:05"
                },
                {
                    "id" : 12,
                    "marker":"ТЗНП",
                    "content" : "E2: ДФЗ, 1ст.ТЗНП",
                    "start_time" : "2013-03-13 16:23:25"
                }
            ]
        },
        {
            "id" : 2,
            "message" : "M02: 16-21 АО с неуспешным АПВ ВЛ-220. Б10-Погорелово.",
            "start_time" : "2013-03-13 16:45:05",
            "end_time" : "2013-03-13 16:55:05",
            "events" : [
                {
                    "id" : 111,
                    "marker":"АПВ",
                    "content" : "E1: АПВ неуспешно",
                    "start_time" : "2013-03-13 16:45:05"
                }
            ]
        },
        {
            "id" : 3,
            "message" : "M03: 17-08 РПВ ВЛ-220 Б10-Погорелово успешно. ВЛ в работе.",
            "start_time" : "2013-03-13 17:25:26",
            "end_time" : "2013-03-13 17:35:50",
            "events" : [
                {
                    "id" : 27,
                    "marker":"РПВ",
                    "content" : "E3: РПВ успешно",
                    "start_time" : "2013-03-13 17:08:26"
                },
                {
                    "id" : 288,
                    "marker":"ВЛ",
                    "content" : "E4: ВЛ в работе",
                    "start_time" : "2013-03-13 17:15:26"
                }
            ]
        }
    ]
};

var situation_data = [situation1];